exp-cookbook/app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("created_at", "title", "updated_at", "category_id") VALUES('2009-03-25 18:05:58', 'test', '2009-03-25 18:05:58', NULL)
---
  def create
    @recipe = Recipe.new(params[:recipe])

    respond_to do |format|
      if @recipe.save