exp-products/app/controllers/brands_controller.rb

  def show
    @brand = @client.brands.find(params[:id])
---
SELECT * FROM "brands" WHERE ("brands"."id" = 1 AND ("brands".client_id = 2))

    def load_client
      @client = Client.find(params[:client_id])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 2)