exp-products/app/controllers/products_controller.rb

  def index
    @products = @brand.products.find(:all)
---
SELECT * FROM "products" WHERE ("products".brand_id = 1)

  def show
    @product = @brand.products.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 1 AND ("products".brand_id = 1))

  def edit
    @product = @brand.products.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 1 AND ("products".brand_id = 1))

  def create
    @product = @brand.products.build(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "created_at", "updated_at", "description", "verified", "product_code", "brand_id") VALUES('my product', '2009-03-25 17:50:52', '2009-03-25 17:50:52', 'description', 'f', '000', 2)

  def update
    @product = @brand.products.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM "products" WHERE ("products"."id" = 1 AND ("products".brand_id = 1))
UPDATE "products" SET "updated_at" = '2009-03-24 18:23:15', "description" = 'brand x product descriptions' WHERE "id" = 1

    def load_client
      @client = Client.find(params[:client_id])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 2)

    def load_brand
      @brand = @client.brands.find(params[:brand_id])
---
SELECT * FROM "brands" WHERE ("brands"."id" = 2 AND ("brands".client_id = 2))