backpack/test/app/controllers/users_controller.rb

  def forgot_password
    if request.post?
      #change find_by_username to find_by_email
      if @user = User.find_by_email(params[:user][:email])
---
SELECT * FROM "users" WHERE ("users"."email" = 'dfdf') LIMIT 1

  def new
    if request.post?
      #create user
      @user = User.new(params[:user])
      @user.save!
---
INSERT INTO "users" ("updated_at", "password_salt", "validated_at", "role", "remember_token", "email", "password_crypt", "email_validation_key", "created_at") VALUES('2009-01-22 23:39:12', 'bdc1a0cb4750a26f0997fd18ecd1513c7a8fcc58', NULL, NULL, 'c4c7799d135ff544', 'cool', '11c9b7a376101e75f473c596a4b69ba1d3b24dc2', NULL, '2009-01-22 23:39:12')